namespace Model.Common
{
	/// <summary>
	/// 错误信息
	/// </summary>
	public enum ErrorMessage
	{
		未知错误 = -1,
		失败 = 0,
		成功 = 1,

		//用户
		用户名为空 = 10110,

		用户不存在 = 10120,
		用户名已存在 = 10130,
		用户名以字母开头包含字符数字和下划线 = 10140,
		用户名或密码错误 = 10150,
		密码为空 = 10160,
		新密码为空 = 10161,
		呢称为空 = 10170,
		账户已被锁定请30分钟后再试 = 10180,
		帐号密码连续错误5次将被锁定30分钟无法登录 = 10190,
		手机号码为空 = 10200,
		手机号码错误 = 10210,
		手机号码未注册 = 10220,
		该手机号已经注册过 = 10230,
		用户已绑定平台帐号 = 10231,
		城市为空 = 10240,
		性别为空 = 10241,
		余额不足 = 10242,

		//验证码
		验证码为空 = 10250,

		验证码错误 = 10260,
		验证码发送太频繁请稍候再试 = 10270,
		验证码验证次数已到上限请重新发送 = 10280,
		类型为空 = 10290,

		章节号为空 = 10310,
		没有受影响行数 = 10320,
		类别Id为空 = 10330,
		评论Id为空 = 10340,
		评论不存在 = 10341,

		//充值
		商户号为空 = 10500,

		支付类型为空 = 10510,
		标题为空 = 10520,
		金额为空 = 10530,
		最低充值20元 = 10531,
		短信指令错误 = 10540,
		订单号为空 = 10550,
		生成订单号失败 = 10560,
		订单初始化失败 = 10570,
		支付参数错误 = 10580,

		//上传
		图片类别为空 = 10700,

		请选择上传的文件 = 10710,
		后缀名为空 = 10720,
		后缀名错误 = 10730,

		//公共错误信息
	};
}